In [2]:
from sqlalchemy import create_engine
import sys, os
import pandas as pd

constr = 'mysql+pymysql://{user}:{pwd}@{host}'.format(user=os.environ['MYSQL_USERNAME'],
                                                      pwd=os.environ['MYSQL_PASSWORD'],
                                                      host=os.environ['MYSQL_HOST'])
con = create_engine(constr)

df = pd.read_sql('select * from plwiki_p.logging limit 10', con)

In [25]:
# Get all pages not translated to English from ukrainan wikipedia

df2 = pd.read_sql('''
SELECT 
    ips_item_id AS wikidata, 
    ips_site_page AS title
FROM 
    wikidatawiki_p.wb_items_per_site 
WHERE 
    ips_site_id = 'ukwiki' AND 
    ips_item_id NOT IN (
        SELECT 
            ips_item_id 
        FROM 
            wikidatawiki_p.wb_items_per_site 
        WHERE 
            ips_site_id= 'enwiki')''', con)

In [27]:
df2.title = df2.title.str.decode("utf-8")
df2.to_csv('uk_not_translated.csv', index=False)

In [28]:
df2.head()

   wikidata                title
0  12061549  ! (альбом С.К.А.Й.)
1   4027682                !ФЕСТ
2  12061550               !Чидро
3  30196568          $uicideboy$
4     11511                  &RQ

In [30]:
# Get all pages not translated to English from ukrainan wikipedia

df_translated = pd.read_sql('''
SELECT 
    ips_item_id AS wikidata, 
    ips_site_page AS title
FROM 
    wikidatawiki_p.wb_items_per_site 
WHERE 
    ips_site_id = 'ukwiki' AND 
    ips_item_id IN (
        SELECT 
            ips_item_id 
        FROM 
            wikidatawiki_p.wb_items_per_site 
        WHERE 
            ips_site_id= 'enwiki')''', con)

In [31]:
df_translated.title = df_translated.title.str.decode("utf-8")
df_translated.to_csv('uk_translated.csv', index=False)

In [32]:
df_translated.head()

   wikidata          title
0   4540205     ! (альбом)
1    404000   ! (значення)
2    353153  !! (значення)
3       371            !!!
4    343686  !Action Pact!

In [33]:
# Get all (pageId, title) from ukrainan wikipedia

q_uk_page = """
SELECT page_id as id,
       page_title as title
from ukwiki_p.page as uk_page
where page_namespace=0
"""
df_uk_page = pd.read_sql(q_uk_page, con)

In [36]:
df_uk_page.title = df_uk_page.title.str.decode("utf-8")
df_uk_page.to_csv('all_uk_pages.csv', index=False)

In [37]:
df_uk_page.head()

        id                         title
0   829961                             !
1  2062457                            !!
2   425480                           !!!
3  2591631  !!!Fuck_You!!!_and_Then_Some
4  2141483                 !!_(значення)

In [149]:
df_uk_page['encoded_title'] = df_uk_page.title.str.decode("utf-8")

In [150]:
df_uk_page['encoded_title'][:15]

0                                !
1                               !!
2                              !!!
3     !!!Fuck_You!!!_and_Then_Some
4                    !!_(значення)
5                     !Action_Pact
6                    !Action_Pact!
7                        !T.O.O.H.
8                       !T.O.O.H.!
9                       !_(альбом)
10             !_(альбом_С.К.А.Й.)
11                    !_(значення)
12                           !fest
13                           !ФЕСТ
14                          !Чидро
Name: encoded_title, dtype: object

In [143]:
# read most_viewed_uk_2017 json and convert to normal pandas structure
most_viewed_uk_2017 = pd.read_json('Most view articles in the Ukranian wiki in 2017 Nov.json', lines=False)
most_viewed_uk_2017 = most_viewed_uk_2017['items'].apply(pd.Series)
most_viewed_uk_2017.head()

                     article  views  rank
0           Головна_сторінка    611     1
1    Окуєва_Аміна_Вікторівна    317     2
2                   Хелловін    109     3
3                Адам_Осмаєв     86     4
4  Шевченко_Тарас_Григорович     82     5

In [3]:
"Окуєва_Аміна_Вікторівна" in df_uk_page['encoded_title'].unique()

NameError: name 'df_uk_page' is not defined

In [159]:
uk_articles_that_have_2017_review_data = df_uk_page.encoded_title.isin(most_viewed_uk_2017.article)

In [161]:
pd.mergedf_uk_page[uk_articles_that_have_2017_review_data]

,id,title,encoded_title
20596,1394,b'1_\xd0\xbb\xd0\xb8\xd1\x81\xd1\x82\xd0\xbe\x...,1_листопада
29401,1633568,b'2K',2K
29473,1411,b'2_\xd0\xbb\xd0\xb8\xd1\x81\xd1\x82\xd0\xbe\x...,2_листопада
29884,2664596,b'300_\xd1\x81\xd0\xbf\xd0\xb0\xd1\x80\xd1\x82...,300_спартанців
53092,1083697,b'A3_(\xd0\xbf\xd0\xb0\xd0\xbf\xd1\x96\xd1\x80)',A3_(папір)

In [34]:
q = '''
SELECT rev_page as page_id,
       count(*) as rev_count
from ukwiki_p.revision as rev
join ukwiki_p.page as p
    on p.page_id = rev.rev_page
    where p.page_namespace=0
group by page_id
'''
revs = pd.read_sql(q, con)

/srv/paws/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1052, "Column 'page_id' in group statement is ambiguous")
  result = self._query(query)

In [36]:
revs.shape

(1245962, 2)

In [38]:
revs.head()

   page_id  rev_count
0        2          6
1        3        408
2        6          6
3        9          4
4       13        340

In [39]:
revs.to_csv('revisions_count.csv', index=False)

In [38]:
q = """
SELECT page_id as id,
       page_title as title,
       page_len as len
from ukwiki_p.page as uk_page
where page_namespace=0
"""
df_uk_page = pd.read_sql(q, con)

In [40]:
df_uk_page.title = df_uk_page.title.str.decode("utf-8")
df_uk_page.to_csv('all_uk_pages.csv', index=False)

In [21]:
q = """
select cl_from as page_id
from enwiki_p.categorylinks as cl
join ukwiki_p.page as p
    on p.page_id = cl.cl_from
    and p.page_namespace=0 
where cl.cl_to = 'Articles_needing_translation_from_Ukrainian_Wikipedia'
"""
df_uk_page = pd.read_sql(q, con)

In [22]:
df_uk_page

   page_id
0  1481810
1  1620858
2  1583341
3  2016412